




/* eslint-disable no-irregular-whitespace */
/* eslint-disable max-len */

export const USER_PROTOCAL_BODY_HTML = `  <p><span class="pydocx-center"><strong>智课斩雅思</strong><strong>用户协议</strong></span></p>
    <p><span class="pydocx-left"><strong>一、</strong><strong>特别提示</strong></span></p>
    <p><span
            class="pydocx-left">1、智课斩雅思同意按照本协议的规定及其不时发布的操作规则提供基于互联网/移动网的相关服务（以下称“网络服务”），为获得网络服务，服务使用人（以下称“用户”）应当同意本协议的全部条款并按照页面上的提示完成全部的注册程序。用户进行注册或使用即表示用户完全接受本协议项下的全部条款。如用户不同意本协议任何条款，请勿注册账号或使用本平台。</span>
    </p>
    <p><span
            class="pydocx-left">2、用户注册成功后，智课斩雅思将给予每个用户一个用户帐号及相应的密码，该用户帐号和密码由用户负责保管；用户应当对以其用户帐号进行的所有活动和事件负法律责任。</span>
    </p>
    <p><span
            class="pydocx-left">3、用户注册成功，智课斩雅思可能会向每位注册用户拨打电话进一步介绍本公司的相关服务情况。用户的注册行为即视同为同意接受公司进一步的电话服务。</span>
    </p>
    <p><span class="pydocx-left"><strong>二、</strong><strong>服务内容</strong></span></p>
    <p><span class="pydocx-left">1、智课斩雅思网络服务的具体内容由智课斩雅思根据实际情况提供。</span></p>
    <p><span
            class="pydocx-left">2、智课斩雅思提供的部分网络服务为收费的网络服务，用户使用收费网络服务需要向智课斩雅思支付一定的费用。对于收费的网络服务，智课斩雅思会在用户使用之前给予用户明确的提示，只有用户根据提示确认其愿意支付相关费用，用户才能使用该等收费网络服务。如用户拒绝支付相关费用，则智课斩雅思有权不向用户提供该等收费网络服务。</span>
    </p>
    <p><span
            class="pydocx-left">3、用户理解，智课斩雅思仅提供相关的网络服务，除此之外与相关网络服务有关的设备（如个人电脑、手机、及其他与接入互联网或移动网有关的装置）及所需的费用（如为接入互联网而支付的电话费及上网费、为使用移动网而支付的手机费）均应由用户自行负担。</span>
    </p>
    <p><span class="pydocx-left"><strong>三、</strong><strong>服务变更、中断或终止</strong></span></p>
    <p><span
            class="pydocx-left">1、鉴于网络服务的特殊性，用户同意智课斩雅思有权随时变更、中断或终止部分或全部的网络服务（包括收费网络服务）。如变更、中断或终止的网络服务属于免费网络服务，智课斩雅思无需通知用户，也无需对任何用户或任何第三方承担任何责任；如变更、中断或终止的网络服务属于收费网络服务，智课斩雅思应当在变更、中断或终止之前事先通知用户，并应向受影响的收费用户提供等值的替代性的收费网络服务。</span>
    </p>
    <p><span
            class="pydocx-left">2、用户理解，智课斩雅思需要定期或不定期地对提供网络服务的平台（如互联网网站/APP等）或相关的设备进行检修或者维护，如因此类情况而造成收费网络服务在合理时间内的中断，智课斩雅思无需为此承担任何责任，但智课斩雅思应尽可能事先进行通告。</span>
    </p>
    <p><span
            class="pydocx-left">3、如发生下列任何一种情形，智课斩雅思有权随时中断或终止向用户提供本协议项下的网络服务（包括收费网络服务）而无需对用户或任何第三方承担任何责任：</span>
    </p>
    <p><span class="pydocx-left">（1）用户提供的个人资料不真实</span></p>
    <p><span class="pydocx-left">（2）用户违反本协议中规定的使用规则</span></p>
    <p><span class="pydocx-left">（3）用户在使用收费网络服务时未按规定向智课斩雅思支付相应的服务费</span></p>
    <p><span
            class="pydocx-left">（4）如用户注册的免费网络服务的帐号在任何连续90日内未实际使用，或者用户注册的收费网络服务的帐号在其订购的收费网络服务的服务期满之后连续90日内未实际使用，则智课斩雅思有权暂停、停止直至删除该帐号并停止为该用户提供相关的网络服务。</span>
    </p>
    <p><span class="pydocx-left"><strong>四、</strong><strong>使用规则</strong></span></p>
    <p><span class="pydocx-left">1、用户在申请使用智课斩雅思网络服务时，必须向智课斩雅思提供准确的个人资料，如个人资料有任何变动，必须及时更新。</span>
    </p>
    <p><span
            class="pydocx-left">2、用户不应将其帐号、密码转让或出借予他人使用。如用户发现其帐号遭他人非法使用，应立即通知智课斩雅思。因黑客行为或用户的保管疏忽导致帐号、密码遭他人非法使用，智课斩雅思不承担任何责任。</span>
    </p>
    <p><span
            class="pydocx-left">3、用户同意智课斩雅思有权在提供网络服务过程中以各种方式投放各种商业性广告或其他任何类型的商业信息（包括但不限于在智课斩雅思网站/APP的任何页面上投放广告），并且，用户同意接受智课斩雅思通过电子邮件或其他方式向用户发送商品促销或其他相关商业信息。</span>
    </p>
    <p><span
            class="pydocx-left">4、对于用户通过智课斩雅思网络服务（包括但不限于论坛、BBS、问答）上传到智课斩雅思网站/APP上可公开获取区域的任何内容，用户同意智课斩雅思在全世界范围内具有免费的、永久性的、不可撤销的、非独家的和完全再许可的权利和许可，以使用、复制、修改、改编、出版、翻译、据以创作衍生作品、传播、表演和展示此等内容（整体或部分），和/或将此等内容编入当前已知的或以后开发的其他任何形式的作品、媒体或技术中。</span>
    </p>
    <p><span class="pydocx-left">5、用户在使用智课斩雅思网络服务过程中，必须遵循以下原则：</span></p>
    <p><span class="pydocx-left">（1）遵守中国有关的法律和法规</span></p>
    <p><span class="pydocx-left">（2）遵守所有与网络服务有关的网络协议、规定和程序</span></p>
    <p><span class="pydocx-left">（3）不得为任何非法目的而使用网络服务系统</span></p>
    <p><span
            class="pydocx-left">（4）不得以任何形式使用智课斩雅思网络服务侵犯智课斩雅思的商业利益，包括并不限于发布非经智课斩雅思许可的商业广告</span>
    </p>
    <p><span class="pydocx-left">（5）不得利用智课斩雅思网络服务系统进行任何可能对互联网或移动网正常运转造成不利影响的行为；</span></p>
    <p><span
            class="pydocx-left">（6）不得利用智课斩雅思提供的网络服务上传、展示或传播任何虚假的、骚扰性的、中伤他人的、辱骂性的、恐吓性的、庸俗淫秽的或其他任何非法的信息资料；</span>
    </p>
    <p><span class="pydocx-left">（7）不得侵犯其他任何第三方的专利权、著作权、商标权、名誉权或其他任何合法权益；</span></p>
    <p><span class="pydocx-left">（8）不得利用智课斩雅思网络服务系统进行任何不利于智课斩雅思的行为；</span></p>
    <p><span
            class="pydocx-left">智课斩雅思有权对用户使用智课斩雅思网络服务的情况进行审查和监督(包括但不限于对用户存储在智课斩雅思的内容进行审核)，如用户在使用网络服务时违反任何上述规定，智课斩雅思或其授权的人有权要求用户改正或直接采取一切必要的措施（包括但不限于更改或删除用户张贴的内容等、暂停或终止用户使用网络服务的权利）以减轻用户不当行为造成的影响。</span>
    </p>
    <p><span
            class="pydocx-left">6、智课斩雅思针对某些特定的智课斩雅思网络服务的使用通过各种方式（包括但不限于网页公告、电子邮件、短信提醒等）作出的任何声明、通知、警示等内容视为本协议的一部分，用户如使用该等智课斩雅思网络服务，视为用户同意该等声明、通知、警示的内容。</span>
    </p>
    <p><span class="pydocx-left">7、凡用户昵称中出现如下信息者（包括但不限于），论坛有权进行屏蔽、锁定，甚至注销：</span></p>
    <p><span class="pydocx-left">（1）使用严重违反国家法律法规及风序良俗，包含或暗藏反动、色情等信息（含符号、地址等）的昵称；</span></p>
    <p><span class="pydocx-left">（2）使用党和国家领导人、古今中外比较有影响的名人、网络上知名人士的真实姓名、字、号、艺名、笔名、头衔等为昵称；</span></p>
    <p><span class="pydocx-left">（3）使用国家机构、企事业单位、知名公司或品牌的名称及标识为昵称；</span></p>
    <p><span class="pydocx-left">（4）含性别歧视、种族歧视、地域歧视等信息的昵称；</span></p>
    <p><span class="pydocx-left">（5）含自侮辱、猥亵或者对他人进行侮辱、挑衅、漫骂、人身攻击等不文明、不健康信息的昵称；</span></p>
    <p><span class="pydocx-left">（6）含易产生歧义、引起他人误解的信息的昵称；</span></p>
    <p><span class="pydocx-left">（7）未获得智课斩雅思官方正式许可而使用带有智课斩雅思相关名称的昵称；</span></p>
    <p><span class="pydocx-left">（8）与智课斩雅思老师、及网站/APP管理人员的昵称近似或雷同，并可能引起混淆或纠纷的；</span></p>
    <p><span class="pydocx-left">（9）带有明显广告性质的昵称；</span></p>
    <p><span class="pydocx-left">（10）带有其它法律法规以及论坛禁止规则中所包含信息的昵称。</span></p>
    <p><span class="pydocx-left"><strong>五、</strong><strong>知识产权</strong></span></p>
    <p><span
            class="pydocx-left">1、智课斩雅思提供的网络服务中包含的任何文本、图片、图形、音频和/或视频资料均受版权、商标和/或其它财产所有权法律的保护，未经相关权利人同意，上述资料均不得在任何媒体直接或间接发布、播放、出于播放或发布目的而改写或再发行，或者被用于其他任何商业目的。所有这些资料或资料的任何部分仅可作为私人和非商业用途而保存在某台计算机内。智课斩雅思不就由上述资料产生或在传送或递交全部或部分上述资料过程中产生的延误、不准确、错误和遗漏或从中产生或由此产生的任何损害承担赔偿责任，也不以任何形式，向用户或任何第三方负责。</span>
    </p>
    <p><span class="pydocx-left">2、智课斩雅思为提供网络服务而使用的任何软件（包括但不限于软件中所含的任何图像、照片、动画、录像、录音、音乐、文字和附加程序、随附的帮助材料）的一切权利均属于该软件的著作权人，未经该软件的著作权人许可，用户不得对该软件进行反向工程（reverse
            engineer）、反向编译（decompile）或反汇编（disassemble）。</span></p>
    <p><span class="pydocx-left"><strong>六、</strong><strong>隐私保护</strong></span></p>
    <p><span class="pydocx-left">保护用户隐私是智课斩雅思的一项基本政策，详见智课斩雅思平台公示的《隐私政策》。</span></p>
    <p><span class="pydocx-left"><strong>七、</strong><strong>免责声明</strong></span></p>
    <p><span
            class="pydocx-left">1、用户明确同意其使用智课斩雅思网络服务所存在的风险将完全由其自己承担；因其使用智课斩雅思网络服务而产生的一切后果也由其自己承担，智课斩雅思对用户不承担任何责任。</span>
    </p>
    <p><span class="pydocx-left">2、智课斩雅思不担保网络服务一定能满足用户的要求，也不担保网络服务不会中断，对网络服务的及时性、安全性、准确性也都不作担保。</span></p>
    <p><span
            class="pydocx-left">3、智课斩雅思不保证为向用户提供便利而设置的外部链接的准确性和完整性，同时，对于该等外部链接指向的不由智课斩雅思实际控制的任何网页上的内容，智课斩雅思不承担任何责任。</span>
    </p>
    <p><span
            class="pydocx-left">4、对于因不可抗力或智课斩雅思不能控制的原因造成的网络服务中断或其它缺陷，智课斩雅思不承担任何责任，但将尽力减少因此而给用户造成的损失和影响。</span>
    </p>
    <p><span class="pydocx-left">用户同意，对于智课斩雅思向用户提供的下列产品或者服务的质量缺陷本身及其引发的任何损失，智课斩雅思无需承担任何责任：</span>
    </p>
    <p><span class="pydocx-left">（1）智课斩雅思向用户免费提供的各项网络服务；</span></p>
    <p><span class="pydocx-left">（2）智课斩雅思向用户赠送的任何产品或者服务；</span></p>
    <p><span class="pydocx-left">（3）智课斩雅思向收费网络服务用户附赠的各种产品或者服务。</span></p>
    <p><span class="pydocx-left">（4）本网站/APP会员(或网友)所上传的相片、文章或讨论区发言内容，由该会员(或网友)自行对该相片、文章或讨论区发言内容担保其知识性、专业性以及合法性。</span>
    </p>
    <p><span class="pydocx-left"><strong>八、</strong><strong>违约赔偿</strong></span></p>
    <p><span
            class="pydocx-left">1、如因智课斩雅思违反有关法律、法规或本协议项下的任何条款而给用户造成损失，智课斩雅思同意承担由此造成的损害赔偿责任。</span>
    </p>
    <p><span
            class="pydocx-left">2、用户同意保障和维护智课斩雅思及其他用户的利益，如因用户违反有关法律、法规或本协议项下的任何条款而给智课斩雅思或任何其他第三人造成损失，用户同意承担由此造成的损害赔偿责任。</span>
    </p>
    <p><span class="pydocx-left"><strong>九、</strong><strong>协议修改</strong></span></p>
    <p><span
            class="pydocx-left">智课斩雅思有权随时修改本协议的任何条款，一旦本协议的内容发生变动，智课斩雅思将会直接在智课斩雅思网站/APP上公布修改之后的协议内容，该公布行为视为智课斩雅思已经通知用户修改内容。智课斩雅思也可通过其他适当方式向用户提示修改内容。</span>
    </p>
    <p><span
            class="pydocx-left">如果不同意智课斩雅思对本协议相关条款所做的修改，用户有权停止使用网络服务。如果用户继续使用网络服务，则视为用户接受智课斩雅思对本协议相关条款所做的修改。</span>
    </p>
    <p><span class="pydocx-left"><strong>十、</strong><strong>通知送达</strong></span></p>
    <p><span class="pydocx-left">本协议项下智课斩雅思对于用户所有的通知均可通过网页公告、电子邮件、手机短信或常规的信件传送等方式进行；该等通知于发送之日视为已送达收件人。</span>
    </p>
    <p><span class="pydocx-left">用户对于智课斩雅思的通知应当通过智课斩雅思对外正式公布的通信地址、传真号码、电子邮件地址等联系信息进行送达。</span></p>
    <p><span class="pydocx-left"><strong>十一</strong><strong>、</strong><strong>法律管辖</strong></span></p>
    <p><span class="pydocx-left">1、本协议的订立、执行和解释及争议的解决均应适用中国法律并受中国法院管辖。</span></p>
    <p><span class="pydocx-left">2、如双方就本协议内容或其执行发生任何争议，双方应尽量友好协商解决；协商不成时，任何一方均可向智课斩雅思所在地的人民法院提起诉讼。</span></p>
    <p><span class="pydocx-left"><strong>十二、</strong><strong>其他规定</strong></span></p>
    <p><span class="pydocx-left">1、本协议构成双方对本协议之约定事项及其他有关事宜的完整协议，除本协议规定的之外，未赋予本协议各方其他权利。</span></p>
    <p><span class="pydocx-left">2、如本协议中的任何条款无论因何种原因完全或部分无效或不具有执行力，本协议的其余条款仍应有效并且有约束力。</span></p>
    <p><span class="pydocx-left">3、本协议中的标题仅为方便而设，在解释本协议时应被忽略。</span></p>
`;

